// 1.	შექმენით პროგრამა, რომელიც დაადგენს მომხმარებლის 
// მიერ შეყვანილი წელი ნაკიანია თუ არა, 
// თუ ნაკიანია უნდა გამოუტანოთ ეკრანზე, 
// რომ მოცემული წელი ნაკიანია და თუ არა 
// მაგ შემთხვევაში უნდა გამოიტანოთ რომ წელი არ არის ნაკიანი.
function leapYear(year) {
    if ((year % 4 === 0 && year % 100 !== 0) || (year % 400 === 0)) {
        return "მოცემული წელი ნაკიანია";
    } else {
        return "მოცემული წელი არ არის ნაკიანი";
    }
}
console.log(leapYear(2025));

// 2. შექმენით კალკულატორი, რომელიც შედგება შემდეგი ნაწილებისაგან: 
// მომხმარებელს უნდა შეეძლოს სისტემაში მონაცემების შეტანა prompt-ის მეშვეობით, ეს მონაცემები უნდა იყოს: 
// 1. რიცხვი 1,
// 2. რიცხვი 2,
// 3. მოქმედება
// პირობითი ოპერატორების მეშვეობით დაადგინეთ თუ რა მოქმედება შეიტანა მომხმარებელმა და მოახდინეთ 
// შესაბამისი კალკულაცია.
// მაგ. თუ რიცხვი 1: 10, რიცხვი 2: 23 ხოლო მოქმედება არის მიმატება(+) მაშინ:
// 10+23=33-ის, ანუ გამოგაქვთ 33;

function calculator() {
    let num1 = prompt("შეიყვანეთ რიცხვი 1:");
    if (isNaN(num1) === true) {
        console.log("რიცხვი არასწორ ფორმატშია შეყვანილი!")
    } else {
        let action = prompt("შეიყვანეთ მოქმედება:");
        let num2 = prompt("შეიყვანეთ რიცხვი 2:");
        if (isNaN(num2) === true) {
            console.log("რიცხვი არასწორ ფორმატშია შეყვანილი!")
        } else {
            num1 = Number(num1);
            num2 = Number(num2);
        
            if (action === "+") {
                console.log(num1 + num2);
            } else if (action === "-") {
                console.log(num1 - num2);
            } else if (action === "*") {
                console.log(num1 * num2);
            } else if (action === "/") {
                console.log(num1 / num2);
            } else {
                console.log("არასწორი ოპერატორია შეყვანილი, გთხოვთ, აქედან შეიყვანოთ ერთ-ერთი! +,-,*,/")
            }
            
        }

    }
}
// console.log(calculator())

// 3.შექმენით პაროლის სიძლიერის შემმოწმებელი ფუნქცია, 
// ფუნქციამ უნდა მიიღოს პარამეტრის სახით შესამოწმებელი პაროლი, პირობა ასეთია:
// 1. თუ პაროლი შედგება 3-ზე ნაკლები სიმბოლოსგან იგი უარგისია.
// 2. თუ პაროლი შედგება მინ. 3 მაქ. 6 სიმბოლოსგან იგი სუსტია
// 3. თუ პაროლი შედგება მინ. 6 მაქ. 8 სიმბოლოსგან იგი მისაღებია
// 4. თუ პაროლი შედგება მინ. 8 მაქ. 16 სიმბოლოსგან იგი ძლიერია.
// 5. თუ პაროლი მხოლოდ რიცხვებისგან შედგება იგი უვარგისია.


function passwordChecker(password) {
    if (password.length <3 ) {
        return "პაროლი უვარგისია!";
    } else if (password.length >=3 && password.length >6) {
        return "პაროლი სუსტია!"
    } else if (password.length >=6 && password.length >8) {
        return "პაროლი მისაღებია!"
    } else if (password.length >=8 && password.length >=16) {
        return "პაროლი ძლიერია!"
    } else if (password.search(/[a-z]/i) < 0) {
        return "პაროლი უვარგისია!"
    }
}


// 4. შექმენით ფუნქცია, რომელიც იპოვის ყველზე გრძელ სიტყვას მოცემულ სტრიქონში
function longstr(str) {
  str = str.match(/[a-zA-Z0-9]+/gi);
  let largest = "";
  for (let i = 0; i < str.length; i++) {
      if (str[i].length > largest.length) {
          largest = str[i];
      }
  }
  return largest;
}

// console.log(longstr("my name is Tinatin Tchumbadze"));